app/views/posts/show.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
<ul>
	<% @post.comments.each do |comment| %>